-- ======================1 РАЗДЕЛ======================

--Задание 1
--Укажите ошибки в записи следующих выражений:

--(1) 1+(2+(3+4);                       ||| Нарушен баланс скобок
--(2) False - 4;                        ||| Недопустимая операция над данными типами
--(3) 10 && True;                       ||| Некоректное сравнение
--(4) 10 10;                            ||| Отсутствует оператор
--(5) 7 rem 4;                          ||| функция rem не взята в обратные кавычки ``
--(6) (-2.1234+(3-4))/(4.213/4-0.213);  ||| целые числа следует записать с точкой
--(7) 4 `div` (3*2-6);                  ||| Делить на 0 нельзя


--Задание 2
-- 2. Выполнив следующую последовательность выражений  в  командной
-- строке, определите назначение системной переменной $$:

--Prelude> (220+3)-1
-- 222
--Prelude> $$
-- 222
--Prelude> 444 `div` $$
-- 2