-- ======================2 РАЗДЕЛ======================

import Comparator (comparator) -- импорт самописной функции сравнения вещественных чисел

--Задание 3
--Напишите программу для вычесления функции:

---3.1
f1 x | x <= 0 = abs x - 10
     | otherwise = (x^2)+x+1

testF1 =f1 (-10) == 0
    &&
        f1 5 == 31
    &&
        comparator (f1 5.5) 36.75 2

---3.2
f2 x | x <=35 && x >= -35 = x^3
     | otherwise = abs x

testF2 =f2 4 == 64
    &&
        f2 (-40) == 40
    &&
        comparator (f2 (-40.199)) 40.199 3 

---3.8
f8 x | x < -128 = abs ((x^2)+1)
     | otherwise = x^5

testF8 =f8 (-130) == 16901
    &&
        f8 2 == 32
    &&
        comparator (f8 3.32) 403.3577618 6
