-- ======================2 РАЗДЕЛ======================

--Задание 7
--Напишите функцию, определяющаю по заданным вещественным числам
--x и y номер квадранта, в котором расположена точка A(x, y)

quadrant x y | x > 0 && y > 0 = "I"
             | x > 0 && y < 0 = "IV"
             | x < 0 && y > 0 = "II"
             | x < 0 && y < 0 = "III"
             | otherwise = "Точка не пренадлежит ни одному квадранту"

test = quadrant 1.1 1.0 == "I"
    &&
        quadrant (-5.5) 0.3333 == "II"
    &&
        quadrant (-666) (-3.0) == "III"
    &&
        quadrant 11.1111 (-3.14) == "IV"
    &&
        quadrant 0.0 5 == "Точка не пренадлежит ни одному квадранту"
    &&
        quadrant 4.7 0 == "Точка не пренадлежит ни одному квадранту"