------------------------------10.11.2024-------------------------
----------------------------ЛЫСУНЕЦ АРТЁМ------------------------

----------------------------1 РАЗДЕЛ-----------------------------
--Задание 5
--Пусть f(a) -сумма цифр целого числа а
--Для заданного x вычислите:
--f(f(x+2)+f(2x))*f(x^2)
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}
{-# HLINT ignore "Use otherwise" #-}

f a | x > 99999 = error "Число слишком большое"
    | True = sumD x 0
    where x = abs a
          sumD 0 y = y
          sumD x y = sumD (x `div` 10) (y +  (x `mod` 10))

calcf x = f(f(x+2) + f (2*x)) * f x^2

test5 = calcf 12 == 18
   && calcf (-12) == 63