------------------------------10.11.2024-------------------------
----------------------------ЛЫСУНЕЦ АРТЁМ------------------------

----------------------------1 РАЗДЕЛ-----------------------------
--Задание 7
--Напишите функцию для вычесления значения выражения
--sqrt(1+2005(sqrt(1+2004sqrt(1+2003*2001))))
--f(f(x+2)+f(2x))*f(x^2)
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}
{-# HLINT ignore "Use otherwise" #-}

import Comparator (comparator)

sqrtCalc = sqrt(1+2005*sqrt(1+2004*sqrt(1+2003*2001)))

test7 = comparator sqrtCalc 2004 1