--задача 2.3 (1)

{-
  3*. Напишите программу для вычисления значения функции:


           (?x?-10, если x,0;               (?27x?, если x<-5vx>5;
  (1) f(x)=*                       (5) f(x)=*
           9x2+x+1, если x>0;               9x2-4, если -5,x,5;

           (x3, если -35,x,35;              (1+?x?, если x<-8vx>8;
  (2) f(x)=*                       (6) f(x)=*
           9?x?, если x<-35vx>35;           9x3+x2, если -8,x,8;

           (?x+2?, если x,2;                (-32000-x, если x.127;
  (3) f(x)=*                       (7) f(x)=*
           9x3-1, если x>2;                 9?x3?, если x<127;

           (?3-x?, если x>3;                (?x2+1?, x<-128;
  (4) f(x)=*                       (8) f(x)=*
           9x3+x2, если x,3;                9x5, если x.-128.

-}
f1 :: Integer -> Integer
f1 x = if x <= 0 
         then (-x) - 10
         else x * x + x + 1

test = f1 2 == 7 && f1 (-2) == -8