--задача 4.5

{-
 Сформулируйте правило перевода списочной записи в точечную.
-}

{-
1.Выделите все генераторы, условия и выражения в списочной записи.
2. Преобразуйте все генераторы, условия и выражения в точечные функции,
    используя map, filter, concatMap и другие функции высшего порядка.
3. Комбинируйте точечные функции, используя композицию функций . или 
   применение функций <$>, <*>, и другие операторы для комбинации.
4. Устранение переменных: Уберите явные ссылки на переменные.
-}
-- Функция для представления списка в точечной записи
listToDotNotation :: Show a => [a] -> String
listToDotNotation [] = "[]"
listToDotNotation (x:xs) = show x ++ " : " ++ listToDotNotation xs

test1 = listToDotNotation ([1, 2, 3] :: [Int]) == "1 : 2 : 3 : []"
test2 = listToDotNotation ([5] :: [Int]) == "5 : []"
test3 = listToDotNotation ([] :: [Int]) == "[]"
test4 = listToDotNotation ([[1], [2, 3]] :: [[Int]]) == "[1] : [2,3] : []"
test5 = listToDotNotation ([[1], [2, 3], [4]] :: [[Int]]) == "[1] : [2,3] : [4] : []"


test = test1 && test2 && test3 && test4 && test5



