-- задача 3.4

{-
   4*. Напишите функцию, возвращающую результат перестановки места-
   ми "соседних" элементов заданного списка; например:


   [1,2,3,4,5,6] => [2,1,4,3,6,5],
   [1,2,3]       => [2,1,3].


-}
func :: [a] -> [a]
func lst
    | null lst = []
    | length lst == 1 = lst
    | otherwise = head (tail lst) : head lst : func (tail (tail lst))

test = func [5] == [5] &&
       func [5, 2] == [2, 5] &&
       func [4, 3, 2, 1] == [3, 4, 1, 2] &&
       func [1, 2, 3, 4, 5, 6] == [2, 1, 4, 3, 6, 5]


