-- задача 3.4 ред

{-
    4. Напишите функцию на  языке  Haskell,  реализующую  вычисление
 значения функции Аккермана:
 ш1.0
 
               (x+1,                 если n=0;
               2 x,                  если n=1, y=0;
    A(n,x,y) + * 0,                  если n=2, y=0;
               2 1,                  если n=3, y=0;
               2 2,                  если n.4, y=0;
               9A(n-1,A(n,x,y-1),x), если n-0, y-0.
 
 ш1.1
    Указание. Для тестирования воспользуйтесь тестовыми примерами:
 ш1.0
 
    A(0,x,y)=x+1, A(1,x,y)=x+y, A(2,x,y)=x7y, A(3,x,y)=xy.
 
 ш1.2
-}
a n x y | n == 0 = x+1
        | n == 1 && y == 0 = x
        | n == 2 && y == 0 = 0
        | n == 3 && y == 0 = 1
        | n >=  4 && y == 0 = 2
        | n /=0 && y /= 0 = a (n-1) (a n x (y - 1)) x 
        | otherwise = 0


test = a 0 1 2 == 1 + 1 && a 1 2 3 == 2+3 &&
      a 2 3 4 == 3 * 4 && a 3 4 5 == 4^5